esp8266/Arduino/boards.txt
##############################################################
esp01.name=ESP-01

esp01.upload.tool=esptool
esp01.upload.speed=57600
esp01.upload.wait_for_upload_port=true

esp01.build.mcu=esp8266
esp01.build.f_cpu=80000000L
esp01.build.board=ESP8266_ESP01
esp01.build.core=esp8266
esp01.build.variant=esp01
